Mavrios/stm32f401cc/COTS/MCAL/GPIO/Gpio.c
					}
				} else {
					if (Loc_u8Iterator > GPIO_u8LPINS_MSK) {
						switch (Copy_u8Function) {
						case GPIO_u8ALTERNATE_FUNC_00:
							Loc_AddPort->GPIOx_AFRH &=
									(u32) ~(GPIO_u8ALTERNATE_CLR_MSK
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |=
									(u32) (Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_01:
							Loc_AddPort->GPIOx_AFRH &=
									(u32) ~(GPIO_u8ALTERNATE_CLR_MSK
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |=
									(u32) (Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_02:
							Loc_AddPort->GPIOx_AFRH &=
									(u32) ~(GPIO_u8ALTERNATE_CLR_MSK
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |=
									(u32) (Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_03:
							Loc_AddPort->GPIOx_AFRH &=
									(u32) ~(GPIO_u8ALTERNATE_CLR_MSK
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |=
									(u32) (Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_04:
							Loc_AddPort->GPIOx_AFRH &=
									(u32) ~(GPIO_u8ALTERNATE_CLR_MSK
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |=
									(u32) (Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_05:
							Loc_AddPort->GPIOx_AFRH &=
									(u32) ~(GPIO_u8ALTERNATE_CLR_MSK
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |=
									(u32) (Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_06:
							Loc_AddPort->GPIOx_AFRH &=
									(u32) ~(GPIO_u8ALTERNATE_CLR_MSK
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |=
									(u32) (Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_07:
							Loc_AddPort->GPIOx_AFRH &=
									(u32) ~(GPIO_u8ALTERNATE_CLR_MSK
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |=
									(u32) (Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_08:
									Loc_AddPort->GPIOx_AFRH &= (u32)
											~(GPIO_u8ALTERNATE_CLR_MSK
													<< ((Loc_u8Iterator - 8)
															* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32)
									(Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_09:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32)
									(Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_10:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32)
									(Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_11:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32)
									(Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_12:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32)
									(Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_13:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32)
									(Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_14:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32)
									(Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_15:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32)
									(Copy_u8Function
											<< ((Loc_u8Iterator - 8)
													* GPIO_u8QUADRO_BIT));
							break;
						default:
							Loc_enuReturnError = Gpio_enuErrorAlternateFunction;
							break;
						}
					}
				}

			}
		}
	}

	return Loc_enuReturnError;
}

/*
 * Function:  Gpio_SetAlternateFunc
 * --------------------
 * SELECT THE DESIRED ALTERNATE FUNCTION SPECIFIC PIN
 *
 *  Copy_u8Port: DESIRED PORT (GPIO_u8PORTA - GPIO_u8PORTB - GPIO_u8PORTC - GPIO_u8PORTD - GPIO_u8PORTE - GPIO_u8PORTH)
 *  Copy_u8Pin : DESIRED PIN START FROM GPIO_u8PIN_00 --> GPIO_u8PIN_15
 *  Copy_pu32Function : THE DESIRED ALTERERNATE FUNCTION --> OPTIONS -->
 *  START FROM GPIO_u8ALTERNATE_FUNC_00 --> GPIO_u8ALTERNATE_FUNC_15.
 *
 *  returns: AN ERROR STATUS IF SOMETHING WRONG HAPPENED
 *  CHECK GpioErrorStatus_t ERROR ABOVE.
 */

GpioErrorStatus_t Gpio_SetAlternateFuncPort(void * GPIO_pvPort, u16 Copy_u16Pin,
		u8 Copy_pu32Function) {
	/*DECALRE VARAIBLE TO STORE PIN */
	u8 Loc_u8Iterator;
	GPIO_RegDef_t * Loc_AddPort = GPIO_pvPort;

	/*DEFINE RETURN ERROR STATUS ENUM VARIABLE*/
	GpioErrorStatus_t Loc_enuReturnError = Gpio_enuOk;

	/*CHECK IF THE ADDRESS IS NULL*/
	if (GPIO_pvPort == NULL) {
		Loc_enuReturnError = Gpio_enuErrorNullPointer;
	} else {
		for (Loc_u8Iterator = GPIO_ZERO; Loc_u8Iterator <= GPIO_u8_PINS;
				Loc_u8Iterator++) {
			if (Copy_u16Pin & (GPIO_PIN_MSK << Loc_u8Iterator)) {
				/*CHECK IF THE PIN IN L REGISTER*/
				if (Loc_u8Iterator <= GPIO_u8LPINS_MSK) {
					/*SWITCH IN ALTERANATE FUNCTION TO MAKE SURE IT'S VALID*/
					switch (Copy_pu32Function) {
					case GPIO_u8ALTERNATE_FUNC_00:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					case GPIO_u8ALTERNATE_FUNC_01:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					case GPIO_u8ALTERNATE_FUNC_02:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					case GPIO_u8ALTERNATE_FUNC_03:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					case GPIO_u8ALTERNATE_FUNC_04:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					case GPIO_u8ALTERNATE_FUNC_05:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					case GPIO_u8ALTERNATE_FUNC_06:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					case GPIO_u8ALTERNATE_FUNC_07:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					case GPIO_u8ALTERNATE_FUNC_08:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					case GPIO_u8ALTERNATE_FUNC_09:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					case GPIO_u8ALTERNATE_FUNC_10:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					case GPIO_u8ALTERNATE_FUNC_11:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					case GPIO_u8ALTERNATE_FUNC_12:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					case GPIO_u8ALTERNATE_FUNC_13:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					case GPIO_u8ALTERNATE_FUNC_14:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					case GPIO_u8ALTERNATE_FUNC_15:
						Loc_AddPort->GPIOx_AFRL &= (u32) ~(GPIO_u8ALTERNATE_CLR_MSK
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						Loc_AddPort->GPIOx_AFRL |= (u32) (Copy_pu32Function
								<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
						break;
					default:
						Loc_enuReturnError = Gpio_enuErrorAlternateFunction;
						break;

