Mavrios/stm32f401cc/COTS/MCAL/GPIO/Gpio.c
					}
				} else {
					if (Loc_u8Iterator <= GPIO_u8LPINS_MSK) {
						switch (Copy_pu32Function) {
						case GPIO_u8ALTERNATE_FUNC_00:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_01:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_02:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_03:
							Loc_AddPort->GPIOx_AFRH &=(u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_04:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_05:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_06:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_07:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_08:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_09:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_10:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_11:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_12:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_13:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_14:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						case GPIO_u8ALTERNATE_FUNC_15:
							Loc_AddPort->GPIOx_AFRH &= (u32)
									~(GPIO_u8ALTERNATE_CLR_MSK
											<< (Loc_u8Iterator
													* GPIO_u8QUADRO_BIT));
							Loc_AddPort->GPIOx_AFRH |= (u32) (Copy_pu32Function
									<< (Loc_u8Iterator * GPIO_u8QUADRO_BIT));
							break;
						default:
							Loc_enuReturnError = Gpio_enuErrorAlternateFunction;
							break;
						}
					}
				}

			}
		}
	}

	return Loc_enuReturnError;
}
